In [25]:
import pandas as pd
import numpy as np
import seaborn as sns

In [49]:
titanic = sns.load_dataset('titanic')
tit_1 = titanic
tit_2 = titanic
tit = titanic

In [27]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [28]:
# math operator
(titanic['age']+12).head(10)

0    34.0
1    50.0
2    38.0
3    47.0
4    47.0
5     NaN
6    66.0
7    14.0
8    39.0
9    26.0
Name: age, dtype: float64

In [29]:
(titanic['age']*2).head(10)

0     44.0
1     76.0
2     52.0
3     70.0
4     70.0
5      NaN
6    108.0
7      4.0
8     54.0
9     28.0
Name: age, dtype: float64

# Dealing with dataset

In a data set missing values are either  ? or /A or NaN or 0 or a blank cell

### Steps

1. try again data collect if any mistake in it
2. Which variables (columns) have Missing value remove it if data are not effected 
3. Replace the missing values
   1. How?
      1. Average value of entire variable or similar data point
      2. frequency or mode
      3. replace based on the functions (Data sampler know that)
      4. ML algorithm can also be used
      5. leave it like that
   2. Why?
      1. Its better because no data is lost
      2. less accurate

In [30]:
# where exactly missing values are ?
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [31]:
# use drop na method
titanic.dropna(subset=['deck'], axis=0, inplace=True)
# inplace True modifies the dataframe

In [32]:
titanic.isnull().sum() #find again null value

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [34]:
titanic = titanic.dropna() # remove  from whole dataframe

In [35]:
titanic.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [36]:
titanic.shape

(182, 15)

## Replacing mising values with the average of the column

In [37]:
mean = tit_1['age'].mean()

In [38]:
mean

np.float64(35.77945652173913)

In [39]:
tit_1['age'] = tit_1['age'].replace(np.nan,mean)

In [40]:
tit_1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

# Data formating 
    1. Takiong data on common standard
    2. Ensure data is consistent and understandable
       1. easy togeather
       2. easy to workwith

# Data Normalization
1. uniform the data
2. they have same impact
3. one fish on the sea and other is on the boal
4. also for computational reason

In [41]:
tit_4 = titanic[['age', 'fare']]

In [42]:
tit_4.head()

     age     fare
1   38.0  71.2833
3   35.0  53.1000
6   54.0  51.8625
10   4.0  16.7000
11  58.0  26.5500

# Method of Normalization
1. Simple feature scalling
   x(new) = x(old) / x(max)
2. Min-Max method
3. Z-score (standard score)  -3 to +3
4. Log transformation

In [44]:
# simple feature scalling 
tit_4['fare'] = tit_4['fare']/tit_4['fare'].max() # fare divided by fare mximum
tit_4['age'] = tit_4['age']/tit_4['age'].max()

C:\Users\ssc\AppData\Local\Temp\ipykernel_5936\1118220019.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tit_4['fare'] = tit_4['fare']/tit_4['fare'].max() # fare divided by fare mximum
C:\Users\ssc\AppData\Local\Temp\ipykernel_5936\1118220019.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tit_4['age'] = tit_4['age']/tit_4['age'].max()

In [45]:
tit_4.head()

       age      fare
1   0.4750  0.139136
3   0.4375  0.103644
6   0.6750  0.101229
10  0.0500  0.032596
11  0.7250  0.051822

In [46]:
# Min- Max method
tit_4['fare'] = (tit_4['fare']-tit_4['fare'].min()) / (tit_4['fare'].max()-tit_4['fare'].min())
tit_4.head()

C:\Users\ssc\AppData\Local\Temp\ipykernel_5936\2055848948.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tit_4['fare'] = (tit_4['fare']-tit_4['fare'].min()) / (tit_4['fare'].max()-tit_4['fare'].min())

       age      fare
1   0.4750  0.139136
3   0.4375  0.103644
6   0.6750  0.101229
10  0.0500  0.032596
11  0.7250  0.051822

In [47]:
# Z-score 
tit_4['fare'] = (tit_4['fare']-tit_4['fare'].mean()) / tit_4['fare'].std()
tit_4.head()

C:\Users\ssc\AppData\Local\Temp\ipykernel_5936\1170128888.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tit_4['fare'] = (tit_4['fare']-tit_4['fare'].mean()) / tit_4['fare'].std()

       age      fare
1   0.4750 -0.099835
3   0.4375 -0.337554
6   0.6750 -0.353732
10  0.0500 -0.813428
11  0.7250 -0.684654

In [50]:
# log transformation
tit['fare'] =np.log(tit['fare'])
tit.head()

c:\Users\ssc\miniconda3\envs\data_analysis\lib\site-packages\pandas\core\arraylike.py:399: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,1.981001,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,4.266662,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,2.070022,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,3.972177,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,2.085672,S,Third,man,True,NaN,Southampton,no,True

# Binning
    1. Grouping of values into smaller no of values (bins)
    2. Convert numeric into categories (young , childhood , old) or 1-16 , 17-30 etc
    3. to have better understanding of groups
        Low vs mid vs high price

In [57]:
bins = np.linspace(min(titanic['age']),max(titanic['age']), int(max(titanic['age'])/3))
age_groups = ['child','young','old']
titanic['age'] = pd.cut(titanic['age'], bins ,labels= age_groups, include_lowest= True)
titanic['age']

ValueError: Bin labels must be one fewer than the number of bin edges

## converting categories into dummies
easy to use for computation
Male Female (0,1)

In [54]:
pd.get_dummies(tit['sex'])

     female   male
0     False   True
1      True  False
2      True  False
3      True  False
4     False   True
..      ...    ...
886   False   True
887    True  False
888    True  False
889   False   True
890   False   True

[891 rows x 2 columns]